tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2/ra_gen/hal_data.c
                                  #if ((1) == 4)
                                      &virtual_channel_1_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_2_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_3_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_4_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_5_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_6_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_7_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_8_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_9_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_10_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_11_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_12_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_13_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_14_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_15_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_16_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_17_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_18_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_19_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_20_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_21_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_22_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_23_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_24_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_25_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_26_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_27_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_28_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_29_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_30_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_31_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_32_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_33_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_34_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_35_cfg,
                                  #endif

                                  #if ((0) == 4)
                                      &virtual_channel_36_cfg,
                                  #endif
                                  };
                                  #endif
#if (((1) == 5)||((1) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5)||((0) == 5))
const adc_b_virtual_channel_cfg_t *const group_4_virtual_channels[] = {
                                  #if ((1) == 5)
                                      &virtual_channel_0_cfg,
                                  #endif

                                  #if ((1) == 5)
                                      &virtual_channel_1_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_2_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_3_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_4_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_5_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_6_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_7_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_8_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_9_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_10_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_11_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_12_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_13_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_14_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_15_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_16_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_17_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_18_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_19_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_20_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_21_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_22_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_23_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_24_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_25_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_26_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_27_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_28_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_29_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_30_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_31_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_32_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_33_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_34_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_35_cfg,
                                  #endif

                                  #if ((0) == 5)
                                      &virtual_channel_36_cfg,
                                  #endif
                                  };
                                  #endif
#if (((1) == 6)||((1) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6)||((0) == 6))
const adc_b_virtual_channel_cfg_t *const group_5_virtual_channels[] = {
                                  #if ((1) == 6)
                                      &virtual_channel_0_cfg,
                                  #endif

                                  #if ((1) == 6)
                                      &virtual_channel_1_cfg,
                                  #endif

